{
  "name": "Spanakopita Triangles",
  "description": "Spanakopita triangles are savory Greek pastries filled with spinach and feta cheese, wrapped in flaky phyllo dough. They make a delightful appetizer or snack, bursting with Mediterranean flavors.",
  "cookTime": 30,
  "prepTime": 20,
  "servings": 24,
  "instructions": [
    "Preheat your oven to 375°F (190°C). Line a baking sheet with parchment paper.",
    "In a large skillet, heat olive oil over medium heat. Add chopped onion and garlic, sauté until softened, about 5 minutes.",
    "Add chopped spinach to the skillet and cook until wilted, about 3-5 minutes. Remove from heat and let cool.",
    "In a mixing bowl, combine cooled spinach mixture, crumbled feta cheese, beaten eggs, dill, salt, and pepper. Mix until well combined.",
    "Unwrap the phyllo dough and cover it with a damp towel to prevent drying out. Take one sheet of phyllo dough and brush it lightly with melted butter. Place another sheet on top and repeat the process until you have 6 layers.",
    "Cut the phyllo stack lengthwise into 4 strips. Place a spoonful of the spinach and feta mixture at the bottom of each strip. Fold one corner of the phyllo dough over the filling to form a triangle, continue folding until you reach the end of the strip. Repeat with the remaining strips and filling.",
    "Place the assembled triangles on the prepared baking sheet. Brush the tops with melted butter.",
    "Bake in the preheated oven for 20-25 minutes or until golden brown and crispy.",
    "Remove from the oven and let cool for a few minutes before serving.",
    "Enjoy the spanakopita triangles warm as a delightful appetizer or snack!"
  ],
  "ingredients": [
    {
      "name": "Olive oil",
      "quantity": 2,
      "unit": "tablespoons"
    },
    {
      "name": "Onion",
      "quantity": 1,
      "unit": "medium",
      "notes": "chopped"
    },
    {
      "name": "Garlic",
      "quantity": 2,
      "unit": "cloves",
      "notes": "minced"
    },
    {
      "name": "Spinach",
      "quantity": 10,
      "unit": "ounces",
      "notes": "fresh, chopped"
    },
    {
      "name": "Feta cheese",
      "quantity": 8,
      "unit": "ounces",
      "notes": "crumbled"
    },
    {
      "name": "Eggs",
      "quantity": 2,
      "notes": "beaten"
    },
    {
      "name": "Dill",
      "quantity": 1,
      "unit": "tablespoon",
      "notes": "fresh, chopped"
    },
    {
      "name": "Salt",
      "quantity": 0.5,
      "unit": "teaspoon"
    },
    {
      "name": "Black pepper",
      "quantity": 0.25,
      "unit": "teaspoon",
      "notes": "freshly ground"
    },
    {
      "name": "Phyllo dough",
      "quantity": 12,
      "unit": "sheets",
      "notes": "thawed if frozen"
    },
    {
      "name": "Butter",
      "quantity": 0.5,
      "unit": "cup",
      "notes": "melted"
    }
  ],
  "categories": ["Greek", "Appetizer", "Snack", "Pastry"]
}
